//このプログラムは色のグラデーションの値が知りたいときに、入力されたふたつの色の値同士を計算するプログラム。

#include <iostream>
using namespace std;

int main()
{
	int a[3] = {}, b[3] = {}, c[3] = {};
	int i;

	cout << "ひとつめの色のR、G、Bの値を順番に入力してね\n";
	cin >> a[0] >> a[2] >> a[1];
	cout << "\nひとつめの色の値は、Rが " << a[0] << " Gが " << a[1] << " Bが " << a[2] << "だね。\n\n";

	cout << "ふたつの色のR、G、Bの値を順番に入力してね\n";
	cin >> b[0] >> b[2] >> b[1];
	cout << "\nふたつめの色の値は、Rが " << a[0] << " Gが " << a[1] << " Bが " << a[2] << "だね。\n\n";

	for (i = 0; i <= 100; i++)
	{

		c[0] = (b[0] - a[0]) *i / 100 + a[0];
		c[1] = (b[1] - a[1]) *i / 100 + a[1];
		c[2] = (b[2] - a[2]) *i / 100 + a[2];

		cout << i << "%のときは Rが " << c[0] << " Gが " << c[1] << " Bが " << c[2] << "だよ\n";

	}

	cout << "\nおえかきがんばってね\n\n";

	system("pause");

	return 0;
}